Revit 2026 API

# CompoundStructureLayer(CompoundStructureLayer) Constructor

---

Creates a copy of a compound structure layer.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CompoundStructureLayer(
	CompoundStructureLayer cs
)
```
```vb
Public Sub New (
	cs As CompoundStructureLayer
)
```
```cpp
public:
CompoundStructureLayer(
	CompoundStructureLayer^ cs
)
```
```fsharp
new :
        cs : CompoundStructureLayer -> CompoundStructureLayer
```

#### Parameters

cs CompoundStructureLayer
     The compound structure to copy.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

CompoundStructureLayer Class

CompoundStructureLayer Overload

Autodesk.Revit.DB Namespace